{
  "basics": {
    "name": "Felipe Gomes Miyazato",
    "expertise": "Data engineering, analytics and computational physics",
    "image": "",
    "email": "felipe.miyazato@gmail.com",
    "phone": "+55 11 98428-1366",
    "linkedin": "https://linkedin.com/in/felipe-gomes-miyazato/",
    "github": "https://github.com/felipe-gomes-miyazato",
    "summary": "Experienced Data Engineer with a background in Physics and a strong passion for building scalable and reliable data infrastructure. Proven expertise in designing and implementing ETL/ELT pipelines, data warehousing solutions, and process automation. Adept at leveraging cloud platforms and big data technologies to transform data into actionable insights. Open to remote work, relocation, and new challenges in a data-driven company.",
    "location": {
      "postalCode": "",
      "city": "Sao Paulo",
      "countryCode": "BR",
      "region": "SP"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "felipe-gomes-miyazato",
        "url": "https://github.com/felipe-gomes-miyazato"
      },
      {
        "network": "LinkedIn",
        "username": "felipe-gomes-miyazato",
        "url": "https://www.linkedin.com/in/felipe-gomes-miyazato/"
      }
    ]
  },
  "work": [
    {
      "name": "BairesDev (Contractor for Pinterest)",
      "position": "Data Engineer",
      "startDate": "2024-09",
      "endDate": "Present",
      "summary": "Contracted by BairesDev to work within Pinterest's internal data engineering team. Designed, built, and maintained data pipelines, ETL processes, and analytical tools. Performed data analysis and BI with Superset dashboards and iPython notebooks. Developed custom data integrations for internal tooling. Leveraged technologies such as Python, SparkSQL, Presto/Trino, Airflow, and Superset.",
      "highlights": [
        "Contracted by BairesDev to work within Pinterest's internal data engineering team",
        "Designed, built, and maintained data pipelines for client's internal data engineering team",
        "ETL processes, analytical tool and cross-team collaboration",
        "Data analysis and BI with Superset dashboards and iPython notebooks",
        "ETLs with Airflow for big data with Spark and Presto",
        "Develop custom data integrations for internal tooling",
        "Leverage technologies such as Python, SparkSQL, Presto/Trino and Superset"
      ]
    },
    {
      "name": "GV2C Consulting & Solutions",
      "position": "Robotic Process Automation Consultant",
      "startDate": "2023-11",
      "endDate": "2024-09",
      "summary": "Design and deliver Robotic Process Automation (RPA) solutions for Ambev's internal process automation team. Identify automation opportunities, analyze business requirements, develop and implement bots. Leverage RPA tools like Python (Selenium, SQLalchemy, API integrations...) and ServiceNow (AppEngine, Mid-servers, API integrations...).",
      "highlights": [
        "Design and deliver Robotic Process Automation (RPA) solutions for Ambev's internal process automation team",
        "Identify automation opportunities, analyze business requirements, develop and implement bots",
        "Leverage RPA tools like Python (Selenium, SQLalchemy, API integrations...) and ServiceNow (AppEngine, Mid-servers, API integrations...)"
      ]
    },
    {
      "name": "Ali Crédito",
      "position": "Data Specialist",
      "startDate": "2022-01",
      "endDate": "2023-08",
      "summary": "Data analysis and BI with dashboards and iPython notebooks. Data mining and web scraping for databases and CRM enrichment. Design, development and management of integrations, data pipelines, process automations, ETLs, databases and CRM with Python and SQL in AWS. Technical leadership with team and project management, code review. Development of calculation engines for financial products in micro-services frameworks. Operational support and monitoring.",
      "highlights": [
        "Data analysis and BI with dashboards and iPython notebooks",
        "Data mining and web scraping for databases and CRM enrichment",
        "Design, development and management of integrations, data pipelines, process automations, ETLs, databases and CRM with Python and SQL in AWS",
        "Technical leadership with team and project management, code review",
        "Development of calculation engines for financial products in micro-services frameworks",
        "Operational support and monitoring"
      ]
    },
    {
      "name": "GV2C Consulting & Solutions",
      "position": "Data Engineer",
      "startDate": "2020-10",
      "endDate": "2021-12",
      "summary": "Automation and process optimization consulting for accounting reports automation projects. Development of Python ETLs with cookiecutter. Project planning and management.",
      "highlights": [
        "Automation and process optimization consulting for accounting reports automation projects",
        "Development of Python ETLs with cookiecutter",
        "Project planning and management"
      ]
    },
    {
      "name": "Freelance",
      "position": "Data Miner",
      "startDate": "2020-07",
      "endDate": "2020-08",
      "summary": "Data mining and database consolidation for scientific research purposes. Project management. Web-scraping with Scrapy and REST API. Parallel data processing with Dask.",
      "highlights": [
        "Data mining and database consolidation for scientific research purposes",
        "Project management",
        "Web-scraping with Scrapy and REST API",
        "Parallel data processing with Dask"
      ]
    },
    {
      "name": "Predicta",
      "position": "Data Scientist",
      "startDate": "2020-01",
      "endDate": "2020-03",
      "summary": "Development of Python ETLs in GCP environment (Big Query, Cloud Functions, and blob storages). Development of data integrations with Google digital marketing platforms.",
      "highlights": [
        "Development of Python ETLs in GCP environment (Big Query, Cloud Functions, and blob storages)",
        "Development of data integrations with Google digital marketing platforms"
      ]
    },
    {
      "name": "TEVEC Inteligência Artificial",
      "position": "Data Scientist",
      "startDate": "2018-07",
      "endDate": "2019-11",
      "summary": "Development and analysis of ML models with scikit-learn. Modeling and analysis of time series for retail sales volume forecasts and supply chain optimization.",
      "highlights": [
        "Development and analysis of ML models with scikit-learn",
        "Modeling and analysis of time series for retail sales volume forecasts and supply chain optimization"
      ]
    },
    {
      "name": "Media Portal Soluções",
      "position": "Software Developer",
      "startDate": "2017-01",
      "endDate": "2017-03",
      "summary": "Projeto de integração de serviços de redes sociais com serviços AI para implementação de sistema de ranqueamento de conteúdo.",
      "highlights": [
        "Projeto de integração de serviços de redes sociais com serviços AI para implementação de sistema de ranqueamento de conteúdo"
      ]
    }
  ],
  "education": [
    {
      "institution": "Ciências Moleculares (USP)",
      "area": "Computational physics and artificial intelligence",
      "studyType": "Interdisciplinary studies and scientific research",
      "startDate": "2015",
      "endDate": "2018",
      "location": "São Paulo, Brazil"
    },
    {
      "institution": "Instituto de Física da Universidade de Sao Paulo (IFUSP)",
      "area": "Physics",
      "studyType": "Bachelor's",
      "startDate": "2015",
      "endDate": "2020",
      "location": "São Paulo, Brazil"
    }
  ],
  "workExperience": [
    { "name": "Python", "years": 8 },
    { "name": "Machine Learning", "years": 2 },
    { "name": "Data Engineering", "years": 6 },
    { "name": "Project Management", "years": 6 },
    { "name": "ICEBERG", "years": 2 },
    { "name": "SQL", "years": 6 },
    { "name": "Data Analysis & BI", "years": 6 },
    { "name": "AWS", "years": 4 },
    { "name": "Web Scraping", "years": 3 },
    { "name": "Airflow", "years": 4 }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Professional"
    },
    {
      "language": "Spanish",
      "fluency": "Professional"
    },
    {
      "language": "Portuguese",
      "fluency": "Native"
    },
    {
      "language": "Catalan",
      "fluency": "Professional"
    }
  ],
  "interests": [
    { "name": "Artificial Intelligence" },
    { "name": "Data Science" },
    { "name": "Machine Learning" },
    { "name": "Programming" },
    { "name": "Data Engineering" },
    { "name": "Music" },
    { "name": "Sports" },
    { "name": "Languages" },
    { "name": "Culture" }
  ]
}